# Categorical Encoding

## Label Encoding

##### import libary

In [1]:
import pandas as pd

##### Dateset

In [3]:

dataset = pd.DataFrame({
    'country':['India', 'US', 'Japan', 'US', 'Japan'],
    'age': [44,34,46,35,23],
    'salary':[72000, 65000, 98000, 45000,34000]
})

##### menampilkan dataset

In [4]:
dataset

  country  age  salary
0   India   44   72000
1      US   34   65000
2   Japan   46   98000
3      US   35   45000
4   Japan   23   34000

In [6]:
from sklearn.preprocessing import LabelEncoder

##### Label encoding pada Scikit learn

In [7]:
label_dataset = LabelEncoder()

In [8]:
dataset['country'] = label_dataset.fit_transform(dataset['country'])

In [9]:
label_dataset.classes_

array(['India', 'Japan', 'US'], dtype=object)

## One-Hot Encoding

##### dataset mengambil dari Label Encoding di atas tepatnya variable 'dataset'

In [10]:
dataset

   country  age  salary
0        0   44   72000
1        2   34   65000
2        1   46   98000
3        2   35   45000
4        1   23   34000

In [11]:
X = dataset['country'].values.reshape(-1,1)

In [12]:
X

array([[0],
       [2],
       [1],
       [2],
       [1]])

##### One-hot encoding pada Scikit learn

In [13]:
from sklearn.preprocessing import OneHotEncoder
onehot_encoder = OneHotEncoder()

In [14]:
X = onehot_encoder.fit_transform(X).toarray()

In [15]:
X

array([[1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       [0., 1., 0.]])

In [21]:
onehot_encoder.categories_

[array([0, 1, 2])]

In [22]:
dataset_onehot= pd.DataFrame(X, columns=[str(i) for i in range(X.shape[1])])
dataset_onehot

     0    1    2
0  1.0  0.0  0.0
1  0.0  0.0  1.0
2  0.0  1.0  0.0
3  0.0  0.0  1.0
4  0.0  1.0  0.0

##### menggabungkan dataframe

In [23]:
dataset=pd.concat([dataset_onehot,dataset], axis=1)
dataset

     0    1    2    0    1    2  age  salary
0  1.0  0.0  0.0  1.0  0.0  0.0   44   72000
1  0.0  0.0  1.0  0.0  0.0  1.0   34   65000
2  0.0  1.0  0.0  0.0  1.0  0.0   46   98000
3  0.0  0.0  1.0  0.0  0.0  1.0   35   45000
4  0.0  1.0  0.0  0.0  1.0  0.0   23   34000